# alice_in_wonderland = '"Would you tell me, please, which way I ought to go from here?"\n"That depends a good deal on where you want to get to," said the Cat.\n"I don't much care where ——" said Alice.\n"Then it doesn't matter which way you go," said the Cat.\n"—— so long as I get somewhere," Alice added as an explanation.\n"Oh, you're sure to do that," said the Cat, "if you only walk long enough."'
# task 01 == Розділіть змінну alice_in_wonderland так, щоб вона займала декілька фізичних лінії
# task 02 == Знайдіть та відобразіть всі символи одинарної лапки (') у тексті
# task 03 == Виведіть змінну alice_in_wonderland на друк

alice_in_wonderland = '"Would you tell me, please, which way I ought to go from here?"\n"That depends a good deal on where you want to get to," said the Cat.\n\
"I don\'t much care where ——" said Alice.\n"Then it doesn\'t matter which way you go," said the Cat.\n"—— so long as I get somewhere," Alice added as an explanation.\n\
"Oh, you\'re sure to do that," said the Cat, "if you only walk long enough."'

print(alice_in_wonderland)

"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
"""
# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
black_sea_area = 436402
azov_sea_area = 37800

task_4_description = (f"Площа Чорного моря становить {black_sea_area} км2, а площа Азовського\n"
f"моря становить {azov_sea_area} км2.Яку площу займають Чорне та Азов-\n"
f"ське моря разом?")

print(task_4_description)

# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
sklad_all = 375291
sklad_1_2 = 250449
sklad_2_3 = 222950

task_5_description = (f"Мережа супермаркетів має 3 склади, де всього розміщено \n"
f"{sklad_all} товар. На першому та другому складах перебуває \n"
f"{sklad_1_2} товарів. На другому та третьому – {sklad_2_3} товарів.\n"
f"Знайдіть кількість товарів, що розміщені на кожному складі.")

print(task_5_description)

# task 06
"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
task_6_description = 'Михайло разом з батьками вирішили купити комп\'ютер, ско-\n'\
'риставшись послугою "Оплата частинами". Відомо, що сплачу-\n'\
'вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть\n'\
'вартість комп\'ютера.'

print(task_6_description)

# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""
task_7_description = "Знайди остачу від діленя чисел:\n"\
"a) 8019 : 8    d) 7248 : 6\n"\
"b) 9907 : 9    e) 7128 : 5\n"\
"c) 2789 : 5    f) 19224 : 9\n"\

print(task_7_description)

# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""
task_8_description = "Іринка, готуючись до свого дня народження, склала список того,\n"\
"що їй потрібно замовити. Обчисліть, скільки грошей знадобиться\n"\
"для даного її замовлення.\n"\
"Назва товару    Кількість   Ціна\n"\
"Піца велика     4           274 грн\n"\
"Піца середня    2           218 грн\n"\
"Сік             4           35 грн\n"\
"Торт            1           350 грн\n"\
"Вода            3           21 грн"

print(task_8_description)

# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
task_9_description = "Ігор займається фотографією. Він вирішив зібрати всі свої 232\n"\
"фотографії та вклеїти в альбом. На одній сторінці може бути\n"\
"розміщено щонайбільше 8 фото. Скільки сторінок знадобиться\n"\
"Ігорю, щоб вклеїти всі фото?"

print(task_9_description)

# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""
task_10_description = "Родина зібралася в автомобільну подорож із Харкова в Буда-\n"\
"пешт. Відстань між цими містами становить 1600 км. Відомо,\n"\
"що на кожні 100 км необхідно 9 літрів бензину. Місткість баку\n"\
"становить 48 літрів.\n"\
"1) Скільки літрів бензину знадобиться для такої подорожі?\n"\
"2) Скільки щонайменше разів родині необхідно заїхати на зап-\n"\
"равку під час цієї подорожі, кожного разу заправляючи пов-\n"\
"ний бак?"

print(task_10_description)

